klchai/ai-passport-liquid-glass-ui/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 当前产品/固件基线使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 固定 8MB 镜像头，关闭 detect，便于 idf.py merge-bin。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n
# 3 MB 应用上限与小程序 BLE Recovery 安装器保持一致。分区表
# 还固定保留 cardid@0x356000 与 recovery@0x700000，二创不得改动。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# 开机持续按住上键（GPIO0）5 秒，由自定义 bootloader 跳转到工厂
# 预装的 0x700000 Recovery。这些选项为 bootloader 提供长按检测配置。
CONFIG_BOOTLOADER_FACTORY_RESET=y
CONFIG_BOOTLOADER_NUM_PIN_FACTORY_RESET=0
CONFIG_BOOTLOADER_FACTORY_RESET_PIN_LOW=y
CONFIG_BOOTLOADER_OTA_DATA_ERASE=y
CONFIG_BOOTLOADER_DATA_FACTORY_RESET=""
CONFIG_BOOTLOADER_HOLD_TIME_GPIO=5

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# 48KB 是实测值,不能再降回 24KB:十页轮播在转场时两套 scene 对象树同时存在,叠加
# Kaboo 页 44px 数字字形的 A8 缓冲(单字形约 26x64 = 1.6KB,LVGL 把高度向上取整到 32
# 的倍数),24KB 池会被打穿。池满时 lv_draw_buf_create_ex() 返回 NULL,而
# lv_draw_label.c:647 紧接着对空指针写 header.h,taskLVGL 就死在那里、喂不上看门狗
# (实测两次卡死 MEPC 均为同一地址)。系统启动后仍有约 136KB 空闲堆,这 24KB 增量安全。
CONFIG_LV_MEM_SIZE_KILOBYTES=48
# 给每个 lv_obj_t 加 2 个 32 位字段，记录它的样式里有哪些属性，查属性时直接跳过
# 不含该属性的样式。界面每帧都要大量查询样式（布局、绘制描述符），主机仿真中各页
# 渲染指令数因此少 4%~7%。代价是每个对象 8 字节：转场时两套 scene 同时存在，
# 池峰值也只多约 0.5KB，48KB 池余量充足。
CONFIG_LV_OBJ_STYLE_CACHE=y

# --- 系统 ---
# Liquid Glass 透明合成由 ESP32-C3 CPU 执行；使用 -O2，避免默认 -Og
# 在逐像素混合路径上损失帧率。保留断言用于开发期失效定位。
CONFIG_COMPILER_OPTIMIZATION_DEBUG=n
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000

# --- Bluetooth LE / NimBLE ---
# ESP32-C3 仅支持 BLE；示例只启用单连接 peripheral 所需的最小 host 配置。
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_HOST_BASED_PRIVACY=n
CONFIG_BT_NIMBLE_NVS_PERSIST=n
